# -*- coding: utf8 -*-
# Імпортуємо функцію обчислення кореня
from math import sqrt
# Визначення можливості побудови трикутника. Якщо можливо, то його периметр і площа
# Отримуємо параметри. a, b - катети; c - гіпотенуза
a = float (raw_input("Будь ласка, введіть значення сторони a: "))
b = float (raw_input("Будь ласка, введіть значення сторони b: "))
c = float (raw_input("Будь ласка, введіть значення сторони c: "))
#  Перевіряємо чи значення більші за нуль
if a <= 0 or b <= 0 or c <= 0:
    print ("Значення повинні бути більші за нуль!")
# Перевірямо можливість створення трикутника
# Трикутник  може  існувати  тоді, коли  одночасно  виконуються  наступні умови:
# a+b>c; a+c>b; c+b>a
elif (a+b) > c and (a+c) > b and (c+b) > a:
    print "За даних параметрів, можливо накреслити трикутник!\n"

    # Обчислюємо периметр трикутника
    print "Ви ввели наступні значення:\na={0:.2f}, b={1:.2f}, c={2:.2f}".format(a, b, c)

    P = a + b + c
    print "Периметр трикутника. P = {0:.2f}".format (P)

    # Обчислюємо площу трикутника за теоремою Герона
    # p - півпериметр
    p = P/2
    S = sqrt(p*(p-a)*(p-b)*(p-c))
    print "Площа трикутника. S = {0:.2f}".format(S)
else:
    print "Накреслити трикутник неможливло. Введіть, будь ласка, інші значення.\n"
