# -*- coding: utf8 -*-
from math import sqrt
print "Ця програма розв'язує квадратні рівняння типу ax2+bx+c=0"
a = float (input("Введіть значення a = "))
# Перевірка. Змінна а не може дорівнювати 0.
if a != 0:
    b = float (input("Введіть значення b = "))
    c = float (input("Введіть значення c = "))

    # Перевірка. Число для добутку корення має бути >= 0.
    if (pow(b, 2)- 4*a*c) >= 0:
        x1 = (-b + sqrt(pow(b, 2)- 4*a*c))/2*a
        x2 = (-b - sqrt(pow(b, 2)- 4*a*c))/2*a
        print "1-й корінь рівняння = {}\n2-й корінь рівняння = {}".format(x1, x2)
    else:
        print "Це рівняння немає дійсних коренів!"
else:
    print "a не може дорівнювати нулю"
